Revit 2027 API
FailuresAccessor.IsElementsDeletionPermitted(IList<ElementId>) Method
 Checks if resolution of the failures by deleting given collection of elements is permitted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsElementsDeletionPermitted(
	IList<ElementId> idsToDelete
)
Public Function IsElementsDeletionPermitted (
	idsToDelete As IList(Of ElementId)
) As Boolean
public:
bool IsElementsDeletionPermitted(
	IList<ElementId^>^ idsToDelete
)
member IsElementsDeletionPermitted :
        idsToDelete : IList<ElementId> -> bool
Parameters
idsToDelete IList<ElementId>
 The Ids of elements to be deleted.
Return Value
Boolean
 True if resolution of the failures by deleting given elements is permitted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
Remarks
 Method does not confirm if deletion of the elements will or may resolve the failure - it simply verifies that given elements exist and can be deleted in the current state of the document.
See Also
Reference
FailuresAccessor Class
IsElementsDeletionPermitted Overload
Autodesk.Revit.DB Namespace